Tekla Open API Reference for Tekla Structures 2025
BoltGroup.HoleType Property
 The special hole type: oversized, slotted, blind or no hole.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltGroup.BoltHoleTypeEnum HoleType { get; set; }
Public Property HoleType As BoltGroup.BoltHoleTypeEnum
	Get
	Set
Property Value
Type: BoltGroup.BoltHoleTypeEnum
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace